var status = -1;
var itemList = new Array(2370006,2370007,2370008,2370009,2370010,2370011,2370012);//孫子兵法經驗
var jobName = new Array(
"劍士","法師","弓手","盜賊","海盜","狂狼","魔龍"

);//孫子兵法經驗

//覆蓋上面
itemList_ = new Array(2290248,2290249,2290250,2290251,2290252,2290253,2290254,2290255,2290256,2290257,2290258,2290259,2290260,2290261,2290262,2290263,2290264,2290265,2290266,2290267,2290268,2290269,2290270,2290271,2290272,2290273,2290274);

itemList1 = new Array(
2290000	,//	裝有熔岩的瓶子
2290001	,//	黑色雲霧製作器
2290002	,//	堅忍意志
2290003	,//	[技能書]楓葉祝福
2290004	,//	[技w能書]魔力無限
2290005	,//	[技能書]龍魂之箭
2290006	,//	[技能書]挑釁
2290007	,//	[技能書]進階鬥氣
2290008	,//	[技能書]屬性強化
2290009	,//	[技能書]天使之箭
2290010	,//	[技能書]三飛閃
2290011	,//	古代冰石的粉末
2290012	,//	[技能書]究極突刺
2290013	,//	[技能書]終極之矛
2290014	,//	[技能書]防禦戰術
2290015	,//	[技能書]極冰暴風
2290016	,//	[技能書]宙斯之盾
2290017	,//	[技能書]肥肥的弱點
2290018	,//	[技能書]木妖的弱點
2290019	,//	[技能書]綠水靈的弱點
2290020	,//	
2290021	,//	
2290022	,//	
2290023	,//	
2290024	,//	
2290025	,//	
2290026	,//	[技能書]火輪舞
2290027	,//	[技能書]魔法激發
2290028	,//	[技能書]龍神之怒 
2290029	,//	[技能書]靈魂之石
2290030	,//	[技能書] 絕殺刃
2290031	//	[技能書] 隱‧ 鎖鏈地獄
);

GachItem = new Array(
//劍士開始
[
["通用",
2290000	,//	[技能書]絕對引力	20
2290002	,//	[技能書]武神防禦	20
2290004	,//	[技能書]究極突刺	20
2290006	,//	[技能書]格擋	20

2290001	,//	[技能書]絕對引力	30
2290003	,//	[技能書]武神防禦	30
2290005	,//	[技能書]究極突刺	30
2290007	//	[技能書]格擋	30
],
["英雄",
2290008	,//	[技能書]進階鬥氣	20
2290010	,//	[技能書]無雙劍舞	20
2290016	,//	[技能書]鬥氣爆發	20

2290009	,//	[技能書]進階鬥氣	30
2290011	,//	[技能書]無雙劍舞	30
2290017	,//	[技能書]鬥氣爆發	30
],
["聖騎士",
2290012	,//	[技能書]騎士衝擊波	20
2290014	,//	[技能書]究極神盾	20
2290018	,//	[技能書]聖靈之劍	20
2290019	,//	[技能書]聖靈之棍	20
2290020	,//	[技能書]鬼神之擊	20

2290013	,//	[技能書]騎士衝擊波	30
2290015	,//	[技能書]究極神盾	30
2290021	//	[技能書]鬼神之擊	30
],
["黑騎士",
2290022	,//	[技能書]黑暗力量	20
2290023	//	[技能書]黑暗力量	30
],
],
//法師開始
[
["法師",
2290024	,//	[技能書]魔法反射	20
2290026	,//	[技能書]核爆術	20
2290028	,//	[技能書]魔力無限	20

2290025	,//	[技能書]魔法反射	30
2290027	,//	[技能書]核爆術	30
2290029	//	[技能書]魔力無限	30
],
["冰雷",
2290032	,//	[技能書]閃電連擊	20
2290042	,//	[技能書]寒冰地獄	20
2290044	,//	[技能書]召喚火炎神	20
2290046	,//	[技能書]暴風雪	20

2290033	,//	[技能書]閃電連擊	30
2290043	,//	[技能書]寒冰地獄	30
2290045	,//	[技能書]召喚火炎神	30
2290047	//	[技能書]暴風雪	30
],
["火毒",
2290030	,//	[技能書]劇毒麻痺	20
2290036	,//	[技能書]炎靈地獄	20
2290038	,//	[技能書]召喚冰魔	20
2290040	,//	[技能書]火流星	20

2290031	,//	[技能書]劇毒麻痺	30
2290037	,//	[技能書]炎靈地獄	30
2290039	,//	[技能書]召喚冰魔	30
2290041	//	[技能書]火流星	30
],
["主教",
2290034	,//	[技能書]聖盾護鎧	20
2290048	,//	[技能書]天怒	20
2290050	,//	[技能書]天使之箭	20

2290035	,//	[技能書]聖盾護鎧	30
2290049	,//	[技能書]天怒	30
2290051	//	[技能書]天使之箭	30
]
],
//弓箭手開始
[
["弓箭手",
2290052	,//	[技能書]會心之眼	20
2290054	,//	[技能書]龍魂之箭	20

2290053	,//	[技能書]會心之眼	30
2290055	//	[技能書]龍魂之箭	30
],
["",
2290056	,//	[技能書]弓術精通	20
2290058	,//	[技能書]牽制射擊	20
2290060	,//	[技能書]暴風神射	20
2290062	,//	[技能書]召喚鳳凰	20
2290064	,//	[技能書]念力集中	20

2290057	,//	[技能書]弓術精通	30
2290059	,//	[技能書]牽制射擊	30
2290061	,//	[技能書]暴風神射	30
2290063	,//	[技能書]召喚鳳凰	30
2290065	//	[技能書]念力集中	30
],
["",
2290066	,//	[技能書]弩術精通	20
2290068	,//	[技能書]黑暗狙擊	20
2290070	,//	[技能書]光速神弩	20
2290072	,//	[技能書]召喚銀隼	20
2290074	,//	[技能書]必殺狙擊	20
2290067	,//	[技能書]弩術精通	30
2290069	,//	[技能書]黑暗狙擊	30
2290071	,//	[技能書]光速神弩	30
2290073	,//	[技能書]召喚銀隼	30
2290075	//	[技能書]必殺狙擊	30
]
],
//盜賊開始
[
["盜賊",
2290076	,//	[技能書]瞬身迴避	20
2290078	,//	[技能書]飛毒殺	20
2290080	,//	[技能書]挑釁	20
2290082	,//	[技能書]忍影瞬殺	20

2290077	,//	[技能書]瞬身迴避	30
2290079	,//	[技能書]飛毒殺	30
2290081	,//	[技能書]挑釁	30
2290083	//	[技能書]忍影瞬殺	30
],
["",
2290084	,//	[技能書]三飛閃	20
2290086	,//	[技能書]忍術風影	20
2290088	,//	[技能書]無形鏢	20

2290085	,//	[技能書]三飛閃	30
2290087	,//	[技能書]忍術風影	30
2290089	//	[技能書]無形鏢	30
],
["",
2290090	,//	[技能書]瞬步連擊	20
2290092	,//	[技能書]致命暗殺	20
2290094	,//	[技能書]煙霧彈	20

2290091	,//	[技能書]瞬步連擊	30
2290093	,//	[技能書]致命暗殺	30
2290095	//	[技能書]煙霧彈	30
],
["影武者",
2290153	,//	[技能書]狂刃風暴20
2290154	,//	[技能書] 雙刃旋 20
2290155	,//	[技能書] 替身術 30
2290156	,//	[技能書] 翔飛落葉斬 20
2290157	,//	[技能書] 飛毒殺-改 30
2290158	,//	[技能書] 怪物大爆炸 30
2290159	,//	[技能書] 穢土轉生 30
2290160	,//	[技能書] 幻影替身 30
2290161 //	[技能書] 荊棘特效 30
]
],
//海盜開始
[
["全職業",
2290096	,//	[技能書]楓葉祝福	20
2290125	//	[技能書]楓葉祝福	30
],
["拳霸",
2290097	,//	[技能書]魔龍降臨	20
2290099	,//	[技能書]元氣彈	20
2290101	,//	[技能書]鬥神降世	20
2290102	,//	[技能書]閃．爆破	20
2290104	,//	[技能書]閃．索命	20
2290106	,//	[技能書]閃．連殺	20
2290108	,//	[技能書]最終極速	20
2290110	,//	[技能書]時間置換	20

2290098	,//	[技能書]魔龍降臨	30
2290100	,//	[技能書]元氣彈	30
2290103	,//	[技能書]閃．爆破	30
2290105	,//	[技能書]閃．索命	30
2290107	,//	[技能書]閃．連殺	30
2290111	//	[技能書]時間置換	30
],
["槍神",
2290112	,//	[技能書]瞬‧冰火連擊	20
2290114	,//	[技能書]砲台章魚王	20
2290115	,//	[技能書]海鷗特戰隊	20
2290117	,//	[技能書]瞬‧迅雷	20
2290119	,//	[技能書]海盜加農炮	20
2290121	,//	[技能書]海盜魚雷	20
2290123	,//	[技能書]心靈控制	20
2290124	,//	[技能書]精準砲擊	20

2290113	,//	[技能書]瞬‧冰火連擊	30
2290116	,//	[技能書]海鷗特戰隊	30
2290118	,//	[技能書]瞬‧迅雷	30
2290120	,//	[技能書]海盜加農炮	30
2290122	//	[技能書]海盜魚雷	30
]
],
//狂狼開始
[
["狂狼Lv20",
2290126	,//	[技能書]終極攻擊	20
2290128	,//	[技能書]攻擊戰術	20
2290130	,//	[技能書]靈魂戰鬥	20
2290132	,//	[技能書]終極之矛	20
2290134	,//	[技能書]防禦戰術	20
2290136	,//	[技能書]極冰暴風	20
2290138	//	[技能書]宙斯之盾	20
],
["狂狼Lv30",
2290127	,//	[技能書]終極攻擊	30
2290129	,//	[技能書]攻擊戰術	30
2290131	,//	[技能書]靈魂戰鬥	30
2290133	,//	[技能書]終極之矛	30
2290135	,//	[技能書]防禦戰術	30
2290137	,//	[技能書]極冰暴風	30
2290139	//	[技能書]宙斯之盾	30
]
],

//魔龍倒開始
[
["魔龍Lv20",
2290140	,//	[技能書]四連殺	20
2290142	,//	[技能書]火輪舞	20
2290144	,//	[技能書]魔法激發	20
2290146	,//	[技能書]烈焰爆擊	20
2290148	,//	[技能書]龍神之怒	20
2290150	,//	[技能書]靈魂之石	20
2290151	//	[技能書]龍神的祝福	20
],
["魔龍Lv30",
2290141	,//	[技能書]四連殺	30
2290143	,//	[技能書]火輪舞	30
2290145	,//	[技能書]魔法激發	30
2290147	,//	[技能書]烈焰爆擊	30
2290149	,//	[技能書]龍神之怒	30
2290152	//	[技能書]龍神的祝福	30
]
]

);


function action(mode, type, selection) {
    if (mode == 1) {
		status++;
    } else {
		cm.dispose();
		return ;
    }
    if (status == 0) {
		if (cm.haveItem(5220040,1)) {
			var NoText = "";
			for (var q = 0; q < GachItem.length; q++) {
				if(q%2==0)
					NoText += "\r\n";
				NoText += "#r#L" + q +"##v2290096#  #k[#b技能書#r."+jobName[q]+"#k]#b#l";
			}
		} else {
			cm.sendOk("你無法轉淡。");
			cm.safeDispose();
		}

		
		cm.sendYesNo("#e查看本機台擁有..#n\r\n" + NoText + "#l　");

	
    } else if (status == 1) {
		if (cm.haveItem(5220040,1)) {
			var NoText = "";
			for (var a = 0; a < GachItem[selection].length; a++) {
				//NoText += "#r#L" + q +"##v2290096#  #k[#b技能書#r."+jobName[q]+"#k]#b#l\r\n";
				//NoText += "" + GachItem[0][a] + "" + GachItem[0][a] + "\r\n";
				NoText += "#r#L" + a +"##v2290096#  #k[#b技能書#r."+GachItem[selection][a][0]+"#k]#b#l\r\n";
			}
		} else {
			cm.sendOk("你無法轉淡。");
			cm.safeDispose();
		}
		
		cm.sendYesNo("#e查看本機台擁有..#n\r\n" + NoText + "#l　");
		s = selection;
		
	} else if (status == 2) {
		var msg ="";
		for (var v = 1; v < GachItem[s][selection].length; v++) {
			if ((v-1) % 2 == 0) {
				msg += "\r\n";
			}
			//cm.playerMessage(5, GachItem[selection][v]);
			if (cm.gainIItem(GachItem[s][selection][v]) == 0) {
				msg += "#v" + GachItem[s][selection][v] + ":##t" + GachItem[s][selection][v] + "#	";
			} else {
				msg += "#r#fUI/UIWindow.img/QuestIcon/5/0# (無名稱)#k	";
			}
		}
		cm.sendYesNo("本機台擁有 #e#r" + (GachItem[s][selection].length-1)+ "#k#n 個\r\n" + msg);
		s = selection;
		
	} else if (status == 3) {	
		var 機率 = 0;
		var tessa = "";
		for (var o = 0; o < GachItem.length; o++) {
			機率 = GachItem[o][GachItem[o].length-1]
			tessa = cm.gainRewardItemqss(機率);
			if (tessa == "1") { //0 = 沒中, 1 = 中獎
				//中獎
				var RandomI = Math.floor(Math.random() * (GachItem[o].length-1));
				item = cm.gainGachaponItem(GachItem[o][RandomI], 1, true);
				cm.playerMessage(5, "你抽到機率: " +機率+"%  ");
				cm.dispose();
				return ;//避免重複抽到
				//中獎
			} else {
				cm.playerMessage(5, "共辜");
			}
		}		
		cm.dispose();
    } else if (status == 99) {
		var msg = "";

			if (v % 2 == 0) {
				msg += "\r\n";
			}
			if (cm.gainIItem(itemList[selection]) == 0) {
				msg += "#v" + itemList[selection] + "#t" + itemList[selection] + "#	";
			} else {
				msg += "#r#fUI/UIWindow.img/QuestIcon/5/0# (無名稱)#k	";
			}
		
		s = selection;
	} else if (status == 88) {
		var item;
		var gain = false;
		var i = 24;
		var RandomI = Math.floor(Math.random() * i);// 0 - 24
		
		var TTT = 0;
		for (var a = 0; a < i; a++){
			cm.playerMessage(GachItem[s][a][1]);
		if (GachItem[s][a][2] == RandomI){
			TTT += 1;
			
			
		}
		}
		cm.sendOk("共辜...機率: " + RandomI);
		cm.safeDispose();/*
		if(!gain){
			cm.sendOk("共辜...機率: " + GItem[1]);
		}
		if (item != -1) {
			cm.gainItem(5220040, -1);
			cm.sendOk("您已獲得 #b#t" + item + "##i" + item + "##k");
		} else {
			cm.sendOk("檢查一下背包是否已滿。");
		}
		cm.safeDispose();*/
	}	
}
